/**
 * 
 */
package com.stock.data;

/**
 * @author think
 *
 */
public enum ShStock {
	SHCODE_1("code1","浦发银行(600000) 邯郸钢铁(600001) 齐鲁石化(600002) ST东北高(600003) XD白云机(600004) 武钢股份(600005) 东风汽车(600006) 中国国贸(600007) 首创股份(600008) 上海机场(600009) 包钢股份(600010) 华能国际(600011) 皖通高速(600012) 华夏银行(600015) 民生银行(600016) 日照港(600017) 上港集团(600018) 宝钢股份(600019) 中原高速(600020) 上海电力(600021) 山东钢铁(600022) 浙能电力(600023) 中海发展(600026) 华电国际(600027) 中国石化(600028) 南方航空(600029) 中信证券(600030) 三一重工(600031) 福建高速(600033) 楚天高速(600035) 招商银行(600036) 歌华有线(600037) 中直股份(600038) 四川路桥(600039)"),
	SHCODE_2("code2","保利地产(600048) 中国联通(600050) 宁波联合(600051) 浙江广厦(600052) 中江地产(600053) 黄山旅游(600054) 华润万东(600055) 中国医药(600056) 象屿股份(600057) 五矿发展(600058) 古越龙山(600059) 海信电器(600060) 中纺投资(600061) 华润双鹤(600062) 皖维高新(600063) 南京高科(600064) *ST联谊(600065) 宇通客车(600066) 冠城大通(600067) 葛洲坝(600068) *ST银鸽(600069) 浙江富润(600070) *ST光学(600071) 钢构工程(600072) 上海梅林(600073) 保千里(600074) 新疆天业(600075) 青鸟华光(600076) 宋都股份(600077) 澄星股份(600078) 人福医药(600079) 金花股份(600080) 东风科技(600081) 海泰发展(600082) 博信股份(600083) 中葡股份(600084) 同仁堂(600085) 东方金钰(600086) "),
	SHCODE_3("code3","退市长油(600087) 中视传媒(600088) 特变电工(600089) 啤酒花(600090) *ST明科(600091) S*ST精密(600092) 禾嘉股份(600093) 大名城(600094) 哈高科(600095) 云天化(600096) 开创国际(600097) 广州发展(600098) 林海股份(600099) 同方股份(600100) 明星电力(600101) 莱钢股份(600102) 青山纸业(600103) 上汽集团(600104) 永鼎股份(600105) 重庆路桥(600106) 美尔雅(600107) 亚盛集团(600108) 国金证券(600109) 中科英华(600110) 北方稀土(600111) 天成控股(600112) 浙江东日(600113) 东睦股份(600114) 东方航空(600115) 三峡水利(600116) 西宁特钢(600117) 中国卫星(600118) 长江投资(600119) 浙江东方(600120) 郑州煤电(600121) 宏图高科(600122) 兰花科创(600123) 铁龙物流(600125) "),
	SHCODE_4("code4","杭钢股份(600126) 金健米业(600127) 弘业股份(600128) 太极集团(600129) 波导股份(600130) 岷江水电(600131) 重庆啤酒(600132) 东湖高新(600133) 乐凯胶片(600135) 道博股份(600136) 浪莎股份(600137) 中青旅(600138) 西部资源(600139) 兴发集团(600141) 金发科技(600143) *ST国创(600145) 大元股份(600146) 长春一东(600148) 廊坊发展(600149) 中国船舶(600150) 航天机电(600151) 维科精华(600152) 建发股份(600153) 宝硕股份(600155) 华升股份(600156) 永泰能源(600157) 中体产业(600158) 大龙地产(600159) 巨化股份(600160) 天坛生物(600161) 香江控股(600162) *ST南纸(600163) 新日恒力(600165) 福田汽车(600166) 联美控股(600167) 武汉控股(600168) 太原重工(600169) 上海建工(600170) 上海贝岭(600171) 黄河旋风(600172) 卧龙地产(600173) "),
	SHCODE_5("","美都能源(600175) 中国巨石(600176) 雅戈尔(600177) 东安动力(600178) 黑化股份(600179) 瑞茂通(600180) S*ST云大(600181) S佳通(600182) 生益科技(600183) 光电股份(600184) 格力地产(600185) 莲花味精(600186) 国中水务(600187) 兖州煤业(600188) 吉林森工(600189) 锦州港(600190) 华资实业(600191) 长城电工(600192) 创兴资源(600193) XD中牧股(600195) 复星医药(600196) 伊力特(600197) 大唐电信(600198) 金种子酒(600199) 江苏吴中(600200) 金宇集团(600201) 哈空调(600202) 福日电子(600203) S山东铝(600205) 有研新材(600206) 安彩高科(600207) 新湖中宝(600208) 罗顿发展(600209) 紫江企业(600210) 西藏药业(600211) 江泉实业(600212) 亚星客车(600213) 长春经开(600215) 浙江医药(600216) *ST秦岭(600217) 全柴动力(600218) 南山铝业(600219) 江苏阳光(600220) 海南航空(600221) 太龙药业(600222) 鲁商置业(600223) ");
	
	
	private ShStock(String name,String codes){
		
	}

}
